
const uk = {
    language: "UK",
    cancel: "Скасувати",
    canceled: "Операцію скасовано.",

    address: "Адреса",
    date: "Дата",
    
    success0001: "Налаштування мови успішно оновлено.",
    success0002: "Ваш запит на виведення успішно отримано.",
    success0003: "Інформація про Txid отримана.",
    success0004: "Ви приєдналися до реферала користувача.",
    success0005: "Дані обміну успішно збережено",

    approved: "Схвалено.",
    reject: "Відхилено.",
    pending: "Очікується.",


    working: "🟢 Працюю",
    care: "🟡 На обслуговуванні",
    notWorking: "🔴 Не працює",

    button_sup: "🆘 Підтримка",
    button_account: "👤 Мій аккаунт",
    button_fqa: "ℹ Часто задавані питання",
    button_channel: "📰 Канал у Telegram",
    button_back: "Назад",
    button_check: "Перевірити",
    button_txid: "Введіть Txid (Обов'язково)",
    button_sub: "Підписка",
    button_market: "Обмін",
    button_myPayments: "Мої платежі",
    button_reference: "Реферал",
    button_joinedMyReference: "Ті, хто приєдналися до мого реферала", 
    button_nextStep: "Наступний крок",
    button_previousStep: "Попередній крок", 
    button_enterMarketkeys: "🗒️ Введіть деталі 🗒️",
    button_selectMarket: "Обміни",
    button_editButtons: "Налаштування кнопок",
    button_long: "LONG",
    button_short: "SHORT",
    button_symbols: "СИМВОЛИ",
    button_closeOrder: "Закрити замовлення",
    button_selectLang: "мова",
    button_bot: "бот",
    button_feedBack: "Зворотній зв'язок",
    button_changeLog: "Щоденник змін",

    account: `
Telegram ID: {telegramId}
📆 Дата реєстрації: {createdAt}

🎉 Мова: {lang}
💎 Підписка: {subscriber}.
⏱️ Закінчення підписки: {subEndDate}

🔑 Уподобана валюта: {market}.
`,

    infoMarket_bybit_1: `
1. Увійдіть до свого акаунта на https://bybit.com
2. Після входу натисніть на профіль у правому верхньому кутку 

Якщо у вас ще немає облікового запису https://partner.bybit.com/b/84632 Ви можете створити його тут.
    `,

    infoMarket_bybit_2: `
1. Натисніть на розділ із написом API    
    `,

    infoMarket_bybit_3: `
1. Натисніть "Створити новий ключ"    
    `,

    infoMarket_bybit_4: `
1. Виберіть згенеровані системні API ключі  
    `,

    infoMarket_bybit_5: `
1. Увімкніть опцію читання та запису
2. Увімкніть опцію уніфікованої торгівлі  
3. Збережіть і підтвердьте ключ
    `,
    infoMarket_bybit_6: `
1. Збережіть згенерований API ключ і секретний ключ у безпечному місці
2. Поділіться з ботом API ключем і секретом

❗(API ключ і секретний ключ не можуть бути переглянуті нікому, вони зберігаються в зашифрованому вигляді.)
    `,

    infoMarket_binance_1: `
1. Переведіть ваш обмін на професійний режим.
2. Знайдіть "API".

    `,

    infoMarket_binance_2: `
1. Натисніть на перший результат.
        `,

    infoMarket_binance_3: `
1. Натисніть "Створити API".
    `,

    infoMarket_binance_4: `
1. Виберіть згенеровану опцію.
2. Потім натисніть "Далі".
3. Назвіть API; ім'я не має значення.
4. Завершіть кроки безпеки
    `,

    infoMarket_binance_5: `
1. Натисніть "Редагувати".
    `,
    
    infoMarket_binance_6: `
1. Зніміть позначку з виділеної галочки (важливо).
2. Можна вимкнути дозволи на виведення.
3. Збережіть API ключ і секретний ключ десь.
4. Натисніть кнопку "Зберегти" в верхній частині сторінки.

    `,


    timeout: "Час вийшов.",
    missingAmount: "Відсутня сума.",

    error: "Сталася помилка.",
    error0001: "Не вдалося оновити налаштування мови.",
    error0002: "Сталася помилка під час оновлення налаштувань мови.",
    error0003: "Сталася помилка при збереженні даних обміну. Спробуйте ще раз.",
    
    error00013: "Ви вже зареєстровані за реферальним посиланням",
    error00014: "Користувача з таким реферальним кодом не знайдено",
    error00014: "Ви не можете приєднатися до власної реферальної посилання",

    sub1: "1 місяць",
    sub2: "3 Місяці",
    sub3: "1 Рік",

    rejectPayment: "Ваша покупка підписки була скасована. Якщо ви думаєте, що виникла проблема, ви можете звернутися до підтримки.",
    approvedPayment: "🎉 Ваша покупка підписки була схвалена.",
    underPayment: "Ваш платіж був нижчим за вимогу. Ідентифікатор платежу: {id}.",
    userNotFound: "Користувача не знайдено.",
    processCancelled: "Операцію скасовано.",
    timeoutError: "Ваша операція була скасована через неактивність.",
    selectMarket: "На якій біржі ви хочете торгувати?",
    noSub: "Ця операція вимагає підписки; ви можете отримати додаткову інформацію про підписку в меню Мій акаунт.",
    discountMessage: "{rate} знижка для довідки",
    errorSub: "У вас вже є активна підписка, ви не можете купити іншу підписку, поки попередня не закінчиться.",
    noPayment: "Платіж не знайдено.",
    myPayments: "Мої платежі. (Показано до 10.)",
    endSub: "Ваша підписка завершена, ви можете придбати нову, якщо хочете.",
    selectPaymentType: "Будь ласка, виберіть тип платежу, який ви хочете зробити.",
    myReferences: "Ви можете переглядати користувачів, які приєдналися до вашого реферала. (Показано до 20.)",
    editButtons: "Натисніть на кнопку, яку ви хочете редагувати, і введіть суму для транзакції (кнопки long і short пов'язані)",
    buttonSaved: "Кнопка збережена",
    onlyInteger: "Будь ласка, вводьте тільки цілі числа",
    createdOrder: "Замовлення успішно створено",
    errorCreateOrder: "Сталася помилка при створенні замовлення {err}",
    closedOrder: "Замовлення успішно закрито",
    errorCloseOrder: "Сталася помилка при закритті замовлення: {err}",
    channelMessage: "Наш публічний новинний канал!",
    supMessage: "Повідомте нам про проблему, для якої вам потрібна підтримка", 
    notFound: "Не знайдено",
    available: "Доступно",
    editButtonMessage: "кількість позицій, які ви хочете призначити",
    binanceSideError: `У Binance Futures -> Налаштування -> «Налаштування режиму позиції» потрібно вибрати двосторонній режим позиції (хеджування).`,
    paymentErr: "\nКоли ви здійсните оплату, поділіться інформацією TXID з @rawensupport.\n",
    feedbackMsg: "Напишіть тему, на яку ви хочете дати відгук/пропозицію.",
    sendingFeedback: "Ваш відгук успішно відправлено Дякуємо за інтерес",
    
    bot: `
Версія: {version}
Статус: {status}
`,

    subscribe: `Будь ласка, виберіть пакет, який ви хочете придбати.
    
1 місяць - 149 доларів 
3 місяці - $349 (знижка 30%)
1 рік - $999 (знижка 45%)    

{discount}`,

    market: `
Обмін: {market}
Дата реєстрації: {createdAt}

    `,

    paymentInfo: `
ℹ️ ID: {id}
ℹ️ Платіжний ID: {paymentId}

⚙️ Статус: {status}
📆 Дата створення: {createdAt}

💰 Ціна пакету: {packagePrice}$
⏱️ Тривалість пакету: {packageDay} Днів

💰 Сума до відправлення: {requiredAmount} USDT
💸 Відправлена сума: {receivedAmount} USDT

✉️ Адреса гаманця: {walletAddress}
🪙 Символ: {coinName}
    `,

    deposit: `
📦 Щоб купити пакет, потрібно відправити {price} {symbol}.

❗️ При оплаті, будь ласка, додайте суму комісії та надішліть її! ❗️
❗️ Інакше ваша покупка пакета не буде реалізована! ❗️
{paymentErr}
❗️ Не здійснюйте доставку в іншій мережі! ❗️

💵 Ціна: {price} {symbol}
⏱️ Тривалість: {day} День

\`{address}\`
(Натисніть на гаманець, щоб скопіювати його).
    `,

    refferalMessage: `
👥 Система посилань 👥
                
❗️ Отримуйте +5 днів за кожну покупку підписки запрошених користувачів
                
❗️ Ваше посилання для запрошення:
                
\`{link}\`
                
(Натисніть на посилання, щоб скопіювати 👆)
➖➖➖➖➖
📥 Загальна кількість запрошених користувачів: {totalInvite}
💰 Зароблено на рефералах: {earned} День
Посилання, за яким ви приєдналися: {code}`,

sss: `
### Поширені запитання

1. *Для чого потрібен цей бот?*  
   Цей бот дозволяє професійним трейдерам новин отримувати доступ до новин на 20 секунд раніше та діяти відповідно.

2. *Чи можу я слідкувати за новинами без підключення до біржі?*  
   Так, новини будуть швидко надсилатися вам через цей бот.

3. *Що означають цифри на кнопках біржі?*  
   Цифри на кнопках визначають розмір позиції, яку ви відкриваєте, у доларовому еквіваленті.

4. *Яке плече використовують кнопки?*  
   Використовується плече, встановлене на вашій підключеній біржі (наприклад, якщо 10x, то використовується 10x).

5. *Якщо я запрошу когось за моїм реферальним посиланням без покупки підписки, чи отримаю я 5 днів підписки?*  
   Так, 5 днів безкоштовної підписки буде нараховано на ваш акаунт.

6. *Які біржі можна підключити?*  
   Наразі підтримуються лише Binance та Bybit. У майбутньому буде доступно більше опцій.

7. *Які спеціальні джерела використовує Rawen?*  
   Джерела з Twitter, різні інсайдерські акаунти та детальні дослідження.
`

};

module.exports = uk;
